
#1.数据读写
##读取csv文件

##读取txt文件

#tibble 格式
##data.frame和tibble的不同

#2.数据重塑


##长转宽


##分割
## 分割


##宽转长
#3.数据操作
##[%>%]管道


##修改列名


##[select选择列]查看所有人的数学分数


##[select选择列]查看所有人的数学和语文分数


##[filter选择列]筛选数学小于 80 的同学


##[filter筛选]筛选数学小于 90 且英语小于 80 的同学


##[filter筛选]筛选数学小于 80 或大于 90的同学


##[filter筛选]筛选 bella 的各科成绩


##[filter筛选]对数学成绩进行排序


##[filter筛选]对语文成绩和物理成绩进行排序


##[mutate添加列] 添加一列时间用来计时


##[mutate添加列]添加总分列


##[mutate添加列]统计排名表

###[slice行筛选]查看alice,amy,bella的分数


##[slice行筛选]取成绩排名前百分之 50


##[group_by分组]按照性别分组

##[group_by分组]过滤组数超过 2 的行

#4.数据连接

##按列合并

##按行合并

##按列连接

#5.数据可视化


#6.分支循环

## 例 1.5 实现将百分制分数转化为五级制分数,
##90 +为优，90-80 为良，80-70 为中，70-60 为及格，60 以下不及格
##小明考了 88 分，判断五级制分数
score = 88


###

##循环

##计算前 4 列的均值

##for循环

##while循环

#7.函数和脚本
#求某学生各科成绩平均值，并给出平均值的五分制分数


##脚本
###a.调试


###b.脚本封装
